remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/dualtimer.h
/**
 * \file
 *
 * \brief Component description for DUALTIMER
 *
 * Copyright (c) 2015-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMB11_DUALTIMER_COMPONENT_
#define _SAMB11_DUALTIMER_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR DUALTIMER */
/* ========================================================================== */
/** \addtogroup SAMB11_DUALTIMER ARM General Purpose Dual Timer 
 *  @{
 */

#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'N'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO*/
#endif

#define DUALTIMER_DT1234
#define REV_DUALTIMER                    0x100

/* -------- DUALTIMER_TIMER1LOAD : (DUALTIMER Offset: 0x00) (R/W 32) Timer 1 Load Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TIMER1LOAD:32;             /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} DUALTIMER_TIMER1LOAD_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DUALTIMER_TIMER1LOAD_OFFSET         0x00                                          /**<  (DUALTIMER_TIMER1LOAD) Timer 1 Load Register  Offset */
#define DUALTIMER_TIMER1LOAD_RESETVALUE     0x00u                                         /**<  (DUALTIMER_TIMER1LOAD) Timer 1 Load Register  Reset Value */

#define DUALTIMER_TIMER1LOAD_TIMER1LOAD_Pos 0                                              /**< (DUALTIMER_TIMER1LOAD)  Position */
#define DUALTIMER_TIMER1LOAD_TIMER1LOAD_Msk (0xFFFFFFFFu << DUALTIMER_TIMER1LOAD_TIMER1LOAD_Pos)  /**< (DUALTIMER_TIMER1LOAD)  Mask */
#define DUALTIMER_TIMER1LOAD_TIMER1LOAD(value) (DUALTIMER_TIMER1LOAD_TIMER1LOAD_Msk & ((value) << DUALTIMER_TIMER1LOAD_TIMER1LOAD_Pos))
#define DUALTIMER_TIMER1LOAD_MASK           0xFFFFFFFFu                                    /**< \deprecated (DUALTIMER_TIMER1LOAD) Register MASK  (Use DUALTIMER_TIMER1LOAD_Msk instead)  */
#define DUALTIMER_TIMER1LOAD_Msk            0xFFFFFFFFu                                    /**< (DUALTIMER_TIMER1LOAD) Register Mask  */

/* -------- DUALTIMER_TIMER1VALUE : (DUALTIMER Offset: 0x04) (R/ 32) Timer 1 Current Value Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TIMER1VALUE:32;            /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} DUALTIMER_TIMER1VALUE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DUALTIMER_TIMER1VALUE_OFFSET        0x04                                          /**<  (DUALTIMER_TIMER1VALUE) Timer 1 Current Value Register  Offset */
#define DUALTIMER_TIMER1VALUE_RESETVALUE    0xFFFFFFFFu                                   /**<  (DUALTIMER_TIMER1VALUE) Timer 1 Current Value Register  Reset Value */

#define DUALTIMER_TIMER1VALUE_TIMER1VALUE_Pos 0                                              /**< (DUALTIMER_TIMER1VALUE)  Position */
#define DUALTIMER_TIMER1VALUE_TIMER1VALUE_Msk (0xFFFFFFFFu << DUALTIMER_TIMER1VALUE_TIMER1VALUE_Pos)  /**< (DUALTIMER_TIMER1VALUE)  Mask */
#define DUALTIMER_TIMER1VALUE_TIMER1VALUE(value) (DUALTIMER_TIMER1VALUE_TIMER1VALUE_Msk & ((value) << DUALTIMER_TIMER1VALUE_TIMER1VALUE_Pos))
#define DUALTIMER_TIMER1VALUE_MASK          0xFFFFFFFFu                                    /**< \deprecated (DUALTIMER_TIMER1VALUE) Register MASK  (Use DUALTIMER_TIMER1VALUE_Msk instead)  */
#define DUALTIMER_TIMER1VALUE_Msk           0xFFFFFFFFu                                    /**< (DUALTIMER_TIMER1VALUE) Register Mask  */

/* -------- DUALTIMER_TIMER1CONTROL : (DUALTIMER Offset: 0x08) (R/W 8) Timer 1 Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  ONE_SHOT_COUNT:1;          /**< bit:      0  Mode Select                              */
    uint8_t  TIMER_SIZE:1;              /**< bit:      1  Timer Size                               */
    uint8_t  TIMERPRE:2;                /**< bit:   2..3  Prescale Bits                            */
    uint8_t  RESERVED4:1;               /**< bit:      4  Reserved bit do not use                  */
    uint8_t  INTERRUPT_ENABLE:1;        /**< bit:      5  Active High Interrupt Enable Bit         */
    uint8_t  TIMER_MODE:1;              /**< bit:      6  Mode Bit                                 */
    uint8_t  TIMER_ENABLE:1;            /**< bit:      7  Active High Timer Enable                 */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} DUALTIMER_TIMER1CONTROL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

