remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/dualtimer.h
#define DUALTIMER_TIMER1CONTROL_OFFSET      0x08                                          /**<  (DUALTIMER_TIMER1CONTROL) Timer 1 Control Register  Offset */
#define DUALTIMER_TIMER1CONTROL_RESETVALUE  0x20u                                         /**<  (DUALTIMER_TIMER1CONTROL) Timer 1 Control Register  Reset Value */

#define DUALTIMER_TIMER1CONTROL_ONE_SHOT_COUNT_Pos 0                                              /**< (DUALTIMER_TIMER1CONTROL) Mode Select Position */
#define DUALTIMER_TIMER1CONTROL_ONE_SHOT_COUNT_Msk (0x1u << DUALTIMER_TIMER1CONTROL_ONE_SHOT_COUNT_Pos)  /**< (DUALTIMER_TIMER1CONTROL) Mode Select Mask */
#define DUALTIMER_TIMER1CONTROL_ONE_SHOT_COUNT DUALTIMER_TIMER1CONTROL_ONE_SHOT_COUNT_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use DUALTIMER_TIMER1CONTROL_ONE_SHOT_COUNT_Msk instead */
#define   DUALTIMER_TIMER1CONTROL_ONE_SHOT_COUNT_0_Val 0x0u                                           /**< (DUALTIMER_TIMER1CONTROL) Wrapping Mode  */
#define   DUALTIMER_TIMER1CONTROL_ONE_SHOT_COUNT_1_Val 0x1u                                           /**< (DUALTIMER_TIMER1CONTROL) One-Shot Mode  */
#define DUALTIMER_TIMER1CONTROL_ONE_SHOT_COUNT_0 (DUALTIMER_TIMER1CONTROL_ONE_SHOT_COUNT_0_Val << DUALTIMER_TIMER1CONTROL_ONE_SHOT_COUNT_Pos)  /**< (DUALTIMER_TIMER1CONTROL) Wrapping Mode Position  */
#define DUALTIMER_TIMER1CONTROL_ONE_SHOT_COUNT_1 (DUALTIMER_TIMER1CONTROL_ONE_SHOT_COUNT_1_Val << DUALTIMER_TIMER1CONTROL_ONE_SHOT_COUNT_Pos)  /**< (DUALTIMER_TIMER1CONTROL) One-Shot Mode Position  */
#define DUALTIMER_TIMER1CONTROL_TIMER_SIZE_Pos 1                                              /**< (DUALTIMER_TIMER1CONTROL) Timer Size Position */
#define DUALTIMER_TIMER1CONTROL_TIMER_SIZE_Msk (0x1u << DUALTIMER_TIMER1CONTROL_TIMER_SIZE_Pos)  /**< (DUALTIMER_TIMER1CONTROL) Timer Size Mask */
#define DUALTIMER_TIMER1CONTROL_TIMER_SIZE  DUALTIMER_TIMER1CONTROL_TIMER_SIZE_Msk         /**< \deprecated Old style mask definition for 1 bit bitfield. Use DUALTIMER_TIMER1CONTROL_TIMER_SIZE_Msk instead */
#define   DUALTIMER_TIMER1CONTROL_TIMER_SIZE_0_Val 0x0u                                           /**< (DUALTIMER_TIMER1CONTROL) 16-bit Counter  */
#define   DUALTIMER_TIMER1CONTROL_TIMER_SIZE_1_Val 0x1u                                           /**< (DUALTIMER_TIMER1CONTROL) 32-bit Counter  */
#define DUALTIMER_TIMER1CONTROL_TIMER_SIZE_0 (DUALTIMER_TIMER1CONTROL_TIMER_SIZE_0_Val << DUALTIMER_TIMER1CONTROL_TIMER_SIZE_Pos)  /**< (DUALTIMER_TIMER1CONTROL) 16-bit Counter Position  */
#define DUALTIMER_TIMER1CONTROL_TIMER_SIZE_1 (DUALTIMER_TIMER1CONTROL_TIMER_SIZE_1_Val << DUALTIMER_TIMER1CONTROL_TIMER_SIZE_Pos)  /**< (DUALTIMER_TIMER1CONTROL) 32-bit Counter Position  */
#define DUALTIMER_TIMER1CONTROL_TIMERPRE_Pos 2                                              /**< (DUALTIMER_TIMER1CONTROL) Prescale Bits Position */
#define DUALTIMER_TIMER1CONTROL_TIMERPRE_Msk (0x3u << DUALTIMER_TIMER1CONTROL_TIMERPRE_Pos)  /**< (DUALTIMER_TIMER1CONTROL) Prescale Bits Mask */
#define DUALTIMER_TIMER1CONTROL_TIMERPRE(value) (DUALTIMER_TIMER1CONTROL_TIMERPRE_Msk & ((value) << DUALTIMER_TIMER1CONTROL_TIMERPRE_Pos))
#define   DUALTIMER_TIMER1CONTROL_TIMERPRE_0_Val 0x0u                                           /**< (DUALTIMER_TIMER1CONTROL) 0 Stages, Clock Divided by 1  */
#define   DUALTIMER_TIMER1CONTROL_TIMERPRE_1_Val 0x1u                                           /**< (DUALTIMER_TIMER1CONTROL) 4 Stages, Clock Divided by 16  */
#define   DUALTIMER_TIMER1CONTROL_TIMERPRE_2_Val 0x2u                                           /**< (DUALTIMER_TIMER1CONTROL) 8 Stages, Clock Divided by 256  */
#define   DUALTIMER_TIMER1CONTROL_TIMERPRE_3_Val 0x3u                                           /**< (DUALTIMER_TIMER1CONTROL) Undefined, do not use  */
#define DUALTIMER_TIMER1CONTROL_TIMERPRE_0  (DUALTIMER_TIMER1CONTROL_TIMERPRE_0_Val << DUALTIMER_TIMER1CONTROL_TIMERPRE_Pos)  /**< (DUALTIMER_TIMER1CONTROL) 0 Stages, Clock Divided by 1 Position  */
#define DUALTIMER_TIMER1CONTROL_TIMERPRE_1  (DUALTIMER_TIMER1CONTROL_TIMERPRE_1_Val << DUALTIMER_TIMER1CONTROL_TIMERPRE_Pos)  /**< (DUALTIMER_TIMER1CONTROL) 4 Stages, Clock Divided by 16 Position  */
#define DUALTIMER_TIMER1CONTROL_TIMERPRE_2  (DUALTIMER_TIMER1CONTROL_TIMERPRE_2_Val << DUALTIMER_TIMER1CONTROL_TIMERPRE_Pos)  /**< (DUALTIMER_TIMER1CONTROL) 8 Stages, Clock Divided by 256 Position  */
#define DUALTIMER_TIMER1CONTROL_TIMERPRE_3  (DUALTIMER_TIMER1CONTROL_TIMERPRE_3_Val << DUALTIMER_TIMER1CONTROL_TIMERPRE_Pos)  /**< (DUALTIMER_TIMER1CONTROL) Undefined, do not use Position  */
#define DUALTIMER_TIMER1CONTROL_RESERVED4_Pos 4                                              /**< (DUALTIMER_TIMER1CONTROL) Reserved bit do not use Position */
#define DUALTIMER_TIMER1CONTROL_RESERVED4_Msk (0x1u << DUALTIMER_TIMER1CONTROL_RESERVED4_Pos)  /**< (DUALTIMER_TIMER1CONTROL) Reserved bit do not use Mask */
#define DUALTIMER_TIMER1CONTROL_RESERVED4   DUALTIMER_TIMER1CONTROL_RESERVED4_Msk          /**< \deprecated Old style mask definition for 1 bit bitfield. Use DUALTIMER_TIMER1CONTROL_RESERVED4_Msk instead */
#define DUALTIMER_TIMER1CONTROL_INTERRUPT_ENABLE_Pos 5                                              /**< (DUALTIMER_TIMER1CONTROL) Active High Interrupt Enable Bit Position */
#define DUALTIMER_TIMER1CONTROL_INTERRUPT_ENABLE_Msk (0x1u << DUALTIMER_TIMER1CONTROL_INTERRUPT_ENABLE_Pos)  /**< (DUALTIMER_TIMER1CONTROL) Active High Interrupt Enable Bit Mask */
#define DUALTIMER_TIMER1CONTROL_INTERRUPT_ENABLE DUALTIMER_TIMER1CONTROL_INTERRUPT_ENABLE_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use DUALTIMER_TIMER1CONTROL_INTERRUPT_ENABLE_Msk instead */
#define DUALTIMER_TIMER1CONTROL_TIMER_MODE_Pos 6                                              /**< (DUALTIMER_TIMER1CONTROL) Mode Bit Position */
#define DUALTIMER_TIMER1CONTROL_TIMER_MODE_Msk (0x1u << DUALTIMER_TIMER1CONTROL_TIMER_MODE_Pos)  /**< (DUALTIMER_TIMER1CONTROL) Mode Bit Mask */
#define DUALTIMER_TIMER1CONTROL_TIMER_MODE  DUALTIMER_TIMER1CONTROL_TIMER_MODE_Msk         /**< \deprecated Old style mask definition for 1 bit bitfield. Use DUALTIMER_TIMER1CONTROL_TIMER_MODE_Msk instead */
#define   DUALTIMER_TIMER1CONTROL_TIMER_MODE_0_Val 0x0u                                           /**< (DUALTIMER_TIMER1CONTROL) Free-Running Mode  */
#define   DUALTIMER_TIMER1CONTROL_TIMER_MODE_1_Val 0x1u                                           /**< (DUALTIMER_TIMER1CONTROL) Periodic Mode  */
#define DUALTIMER_TIMER1CONTROL_TIMER_MODE_0 (DUALTIMER_TIMER1CONTROL_TIMER_MODE_0_Val << DUALTIMER_TIMER1CONTROL_TIMER_MODE_Pos)  /**< (DUALTIMER_TIMER1CONTROL) Free-Running Mode Position  */
#define DUALTIMER_TIMER1CONTROL_TIMER_MODE_1 (DUALTIMER_TIMER1CONTROL_TIMER_MODE_1_Val << DUALTIMER_TIMER1CONTROL_TIMER_MODE_Pos)  /**< (DUALTIMER_TIMER1CONTROL) Periodic Mode Position  */
#define DUALTIMER_TIMER1CONTROL_TIMER_ENABLE_Pos 7                                              /**< (DUALTIMER_TIMER1CONTROL) Active High Timer Enable Position */
#define DUALTIMER_TIMER1CONTROL_TIMER_ENABLE_Msk (0x1u << DUALTIMER_TIMER1CONTROL_TIMER_ENABLE_Pos)  /**< (DUALTIMER_TIMER1CONTROL) Active High Timer Enable Mask */
#define DUALTIMER_TIMER1CONTROL_TIMER_ENABLE DUALTIMER_TIMER1CONTROL_TIMER_ENABLE_Msk       /**< \deprecated Old style mask definition for 1 bit bitfield. Use DUALTIMER_TIMER1CONTROL_TIMER_ENABLE_Msk instead */
#define DUALTIMER_TIMER1CONTROL_MASK        0xFFu                                          /**< \deprecated (DUALTIMER_TIMER1CONTROL) Register MASK  (Use DUALTIMER_TIMER1CONTROL_Msk instead)  */
#define DUALTIMER_TIMER1CONTROL_Msk         0xFFu                                          /**< (DUALTIMER_TIMER1CONTROL) Register Mask  */

/* -------- DUALTIMER_TIMER1INTCLR : (DUALTIMER Offset: 0x0c) (/W 8) Timer 1 Interrupt Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  TIMER1INTCLR:1;            /**< bit:      0                                           */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} DUALTIMER_TIMER1INTCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DUALTIMER_TIMER1INTCLR_OFFSET       0x0C                                          /**<  (DUALTIMER_TIMER1INTCLR) Timer 1 Interrupt Clear Register  Offset */
#define DUALTIMER_TIMER1INTCLR_RESETVALUE   0x00u                                         /**<  (DUALTIMER_TIMER1INTCLR) Timer 1 Interrupt Clear Register  Reset Value */

