remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/dualtimer.h
#define DUALTIMER_TIMER1INTCLR_TIMER1INTCLR_Pos 0                                              /**< (DUALTIMER_TIMER1INTCLR)  Position */
#define DUALTIMER_TIMER1INTCLR_TIMER1INTCLR_Msk (0x1u << DUALTIMER_TIMER1INTCLR_TIMER1INTCLR_Pos)  /**< (DUALTIMER_TIMER1INTCLR)  Mask */
#define DUALTIMER_TIMER1INTCLR_TIMER1INTCLR DUALTIMER_TIMER1INTCLR_TIMER1INTCLR_Msk        /**< \deprecated Old style mask definition for 1 bit bitfield. Use DUALTIMER_TIMER1INTCLR_TIMER1INTCLR_Msk instead */
#define DUALTIMER_TIMER1INTCLR_MASK         0x01u                                          /**< \deprecated (DUALTIMER_TIMER1INTCLR) Register MASK  (Use DUALTIMER_TIMER1INTCLR_Msk instead)  */
#define DUALTIMER_TIMER1INTCLR_Msk          0x01u                                          /**< (DUALTIMER_TIMER1INTCLR) Register Mask  */

/* -------- DUALTIMER_TIMER1RIS : (DUALTIMER Offset: 0x10) (R/ 8) Timer 1 Raw Interrupt Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  TIMER1RIS:1;               /**< bit:      0                                           */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} DUALTIMER_TIMER1RIS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DUALTIMER_TIMER1RIS_OFFSET          0x10                                          /**<  (DUALTIMER_TIMER1RIS) Timer 1 Raw Interrupt Status Register  Offset */
#define DUALTIMER_TIMER1RIS_RESETVALUE      0x00u                                         /**<  (DUALTIMER_TIMER1RIS) Timer 1 Raw Interrupt Status Register  Reset Value */

#define DUALTIMER_TIMER1RIS_TIMER1RIS_Pos   0                                              /**< (DUALTIMER_TIMER1RIS)  Position */
#define DUALTIMER_TIMER1RIS_TIMER1RIS_Msk   (0x1u << DUALTIMER_TIMER1RIS_TIMER1RIS_Pos)    /**< (DUALTIMER_TIMER1RIS)  Mask */
#define DUALTIMER_TIMER1RIS_TIMER1RIS       DUALTIMER_TIMER1RIS_TIMER1RIS_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use DUALTIMER_TIMER1RIS_TIMER1RIS_Msk instead */
#define DUALTIMER_TIMER1RIS_MASK            0x01u                                          /**< \deprecated (DUALTIMER_TIMER1RIS) Register MASK  (Use DUALTIMER_TIMER1RIS_Msk instead)  */
#define DUALTIMER_TIMER1RIS_Msk             0x01u                                          /**< (DUALTIMER_TIMER1RIS) Register Mask  */

/* -------- DUALTIMER_TIMER1MIS : (DUALTIMER Offset: 0x14) (R/ 8) Timer 1 Masked Interrupt Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  TIMER1MIS:1;               /**< bit:      0                                           */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} DUALTIMER_TIMER1MIS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DUALTIMER_TIMER1MIS_OFFSET          0x14                                          /**<  (DUALTIMER_TIMER1MIS) Timer 1 Masked Interrupt Status Register  Offset */
#define DUALTIMER_TIMER1MIS_RESETVALUE      0x00u                                         /**<  (DUALTIMER_TIMER1MIS) Timer 1 Masked Interrupt Status Register  Reset Value */

#define DUALTIMER_TIMER1MIS_TIMER1MIS_Pos   0                                              /**< (DUALTIMER_TIMER1MIS)  Position */
#define DUALTIMER_TIMER1MIS_TIMER1MIS_Msk   (0x1u << DUALTIMER_TIMER1MIS_TIMER1MIS_Pos)    /**< (DUALTIMER_TIMER1MIS)  Mask */
#define DUALTIMER_TIMER1MIS_TIMER1MIS       DUALTIMER_TIMER1MIS_TIMER1MIS_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use DUALTIMER_TIMER1MIS_TIMER1MIS_Msk instead */
#define DUALTIMER_TIMER1MIS_MASK            0x01u                                          /**< \deprecated (DUALTIMER_TIMER1MIS) Register MASK  (Use DUALTIMER_TIMER1MIS_Msk instead)  */
#define DUALTIMER_TIMER1MIS_Msk             0x01u                                          /**< (DUALTIMER_TIMER1MIS) Register Mask  */

/* -------- DUALTIMER_TIMER1BGLOAD : (DUALTIMER Offset: 0x18) (R/W 32) Timer 1 Background Load Register (Reload Value for Period Mode) -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TIMER1BGLOAD:32;           /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} DUALTIMER_TIMER1BGLOAD_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DUALTIMER_TIMER1BGLOAD_OFFSET       0x18                                          /**<  (DUALTIMER_TIMER1BGLOAD) Timer 1 Background Load Register (Reload Value for Period Mode)  Offset */
#define DUALTIMER_TIMER1BGLOAD_RESETVALUE   0x00u                                         /**<  (DUALTIMER_TIMER1BGLOAD) Timer 1 Background Load Register (Reload Value for Period Mode)  Reset Value */

#define DUALTIMER_TIMER1BGLOAD_TIMER1BGLOAD_Pos 0                                              /**< (DUALTIMER_TIMER1BGLOAD)  Position */
#define DUALTIMER_TIMER1BGLOAD_TIMER1BGLOAD_Msk (0xFFFFFFFFu << DUALTIMER_TIMER1BGLOAD_TIMER1BGLOAD_Pos)  /**< (DUALTIMER_TIMER1BGLOAD)  Mask */
#define DUALTIMER_TIMER1BGLOAD_TIMER1BGLOAD(value) (DUALTIMER_TIMER1BGLOAD_TIMER1BGLOAD_Msk & ((value) << DUALTIMER_TIMER1BGLOAD_TIMER1BGLOAD_Pos))
#define DUALTIMER_TIMER1BGLOAD_MASK         0xFFFFFFFFu                                    /**< \deprecated (DUALTIMER_TIMER1BGLOAD) Register MASK  (Use DUALTIMER_TIMER1BGLOAD_Msk instead)  */
#define DUALTIMER_TIMER1BGLOAD_Msk          0xFFFFFFFFu                                    /**< (DUALTIMER_TIMER1BGLOAD) Register Mask  */

/* -------- DUALTIMER_TIMER2LOAD : (DUALTIMER Offset: 0x20) (R/W 32) Timer 2 Load Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TIMER2LOAD:32;             /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} DUALTIMER_TIMER2LOAD_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

