remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/dualtimer.h
#define DUALTIMER_TIMER2LOAD_OFFSET         0x20                                          /**<  (DUALTIMER_TIMER2LOAD) Timer 2 Load Register  Offset */
#define DUALTIMER_TIMER2LOAD_RESETVALUE     0x00u                                         /**<  (DUALTIMER_TIMER2LOAD) Timer 2 Load Register  Reset Value */

#define DUALTIMER_TIMER2LOAD_TIMER2LOAD_Pos 0                                              /**< (DUALTIMER_TIMER2LOAD)  Position */
#define DUALTIMER_TIMER2LOAD_TIMER2LOAD_Msk (0xFFFFFFFFu << DUALTIMER_TIMER2LOAD_TIMER2LOAD_Pos)  /**< (DUALTIMER_TIMER2LOAD)  Mask */
#define DUALTIMER_TIMER2LOAD_TIMER2LOAD(value) (DUALTIMER_TIMER2LOAD_TIMER2LOAD_Msk & ((value) << DUALTIMER_TIMER2LOAD_TIMER2LOAD_Pos))
#define DUALTIMER_TIMER2LOAD_MASK           0xFFFFFFFFu                                    /**< \deprecated (DUALTIMER_TIMER2LOAD) Register MASK  (Use DUALTIMER_TIMER2LOAD_Msk instead)  */
#define DUALTIMER_TIMER2LOAD_Msk            0xFFFFFFFFu                                    /**< (DUALTIMER_TIMER2LOAD) Register Mask  */

/* -------- DUALTIMER_TIMER2VALUE : (DUALTIMER Offset: 0x24) (R/ 32) Timer 2 Current Value Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TIMER2VALUE:32;            /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} DUALTIMER_TIMER2VALUE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DUALTIMER_TIMER2VALUE_OFFSET        0x24                                          /**<  (DUALTIMER_TIMER2VALUE) Timer 2 Current Value Register  Offset */
#define DUALTIMER_TIMER2VALUE_RESETVALUE    0xFFFFFFFFu                                   /**<  (DUALTIMER_TIMER2VALUE) Timer 2 Current Value Register  Reset Value */

#define DUALTIMER_TIMER2VALUE_TIMER2VALUE_Pos 0                                              /**< (DUALTIMER_TIMER2VALUE)  Position */
#define DUALTIMER_TIMER2VALUE_TIMER2VALUE_Msk (0xFFFFFFFFu << DUALTIMER_TIMER2VALUE_TIMER2VALUE_Pos)  /**< (DUALTIMER_TIMER2VALUE)  Mask */
#define DUALTIMER_TIMER2VALUE_TIMER2VALUE(value) (DUALTIMER_TIMER2VALUE_TIMER2VALUE_Msk & ((value) << DUALTIMER_TIMER2VALUE_TIMER2VALUE_Pos))
#define DUALTIMER_TIMER2VALUE_MASK          0xFFFFFFFFu                                    /**< \deprecated (DUALTIMER_TIMER2VALUE) Register MASK  (Use DUALTIMER_TIMER2VALUE_Msk instead)  */
#define DUALTIMER_TIMER2VALUE_Msk           0xFFFFFFFFu                                    /**< (DUALTIMER_TIMER2VALUE) Register Mask  */

/* -------- DUALTIMER_TIMER2CONTROL : (DUALTIMER Offset: 0x28) (R/W 8) Timer 2 Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  ONE_SHOT_COUNT:1;          /**< bit:      0  Mode Select                              */
    uint8_t  TIMER_SIZE:1;              /**< bit:      1  Timer Size                               */
    uint8_t  TIMERPRE:2;                /**< bit:   2..3  Prescale Bits                            */
    uint8_t  RESERVED4:1;               /**< bit:      4  Reserved bit do not use                  */
    uint8_t  INTERRUPT_ENABLE:1;        /**< bit:      5  Active High Interrupt Enable Bit         */
    uint8_t  TIMER_MODE:1;              /**< bit:      6  Mode Bit                                 */
    uint8_t  TIMER_ENABLE:1;            /**< bit:      7  Active High Timer Enable                 */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} DUALTIMER_TIMER2CONTROL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DUALTIMER_TIMER2CONTROL_OFFSET      0x28                                          /**<  (DUALTIMER_TIMER2CONTROL) Timer 2 Control Register  Offset */
#define DUALTIMER_TIMER2CONTROL_RESETVALUE  0x20u                                         /**<  (DUALTIMER_TIMER2CONTROL) Timer 2 Control Register  Reset Value */

#define DUALTIMER_TIMER2CONTROL_ONE_SHOT_COUNT_Pos 0                                              /**< (DUALTIMER_TIMER2CONTROL) Mode Select Position */
#define DUALTIMER_TIMER2CONTROL_ONE_SHOT_COUNT_Msk (0x1u << DUALTIMER_TIMER2CONTROL_ONE_SHOT_COUNT_Pos)  /**< (DUALTIMER_TIMER2CONTROL) Mode Select Mask */
#define DUALTIMER_TIMER2CONTROL_ONE_SHOT_COUNT DUALTIMER_TIMER2CONTROL_ONE_SHOT_COUNT_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use DUALTIMER_TIMER2CONTROL_ONE_SHOT_COUNT_Msk instead */
#define   DUALTIMER_TIMER2CONTROL_ONE_SHOT_COUNT_0_Val 0x0u                                           /**< (DUALTIMER_TIMER2CONTROL) Wrapping Mode  */
#define   DUALTIMER_TIMER2CONTROL_ONE_SHOT_COUNT_1_Val 0x1u                                           /**< (DUALTIMER_TIMER2CONTROL) One-Shot Mode  */
#define DUALTIMER_TIMER2CONTROL_ONE_SHOT_COUNT_0 (DUALTIMER_TIMER2CONTROL_ONE_SHOT_COUNT_0_Val << DUALTIMER_TIMER2CONTROL_ONE_SHOT_COUNT_Pos)  /**< (DUALTIMER_TIMER2CONTROL) Wrapping Mode Position  */
#define DUALTIMER_TIMER2CONTROL_ONE_SHOT_COUNT_1 (DUALTIMER_TIMER2CONTROL_ONE_SHOT_COUNT_1_Val << DUALTIMER_TIMER2CONTROL_ONE_SHOT_COUNT_Pos)  /**< (DUALTIMER_TIMER2CONTROL) One-Shot Mode Position  */
#define DUALTIMER_TIMER2CONTROL_TIMER_SIZE_Pos 1                                              /**< (DUALTIMER_TIMER2CONTROL) Timer Size Position */
#define DUALTIMER_TIMER2CONTROL_TIMER_SIZE_Msk (0x1u << DUALTIMER_TIMER2CONTROL_TIMER_SIZE_Pos)  /**< (DUALTIMER_TIMER2CONTROL) Timer Size Mask */
#define DUALTIMER_TIMER2CONTROL_TIMER_SIZE  DUALTIMER_TIMER2CONTROL_TIMER_SIZE_Msk         /**< \deprecated Old style mask definition for 1 bit bitfield. Use DUALTIMER_TIMER2CONTROL_TIMER_SIZE_Msk instead */
#define   DUALTIMER_TIMER2CONTROL_TIMER_SIZE_0_Val 0x0u                                           /**< (DUALTIMER_TIMER2CONTROL) 16-bit Counter  */
#define   DUALTIMER_TIMER2CONTROL_TIMER_SIZE_1_Val 0x1u                                           /**< (DUALTIMER_TIMER2CONTROL) 32-bit Counter  */
#define DUALTIMER_TIMER2CONTROL_TIMER_SIZE_0 (DUALTIMER_TIMER2CONTROL_TIMER_SIZE_0_Val << DUALTIMER_TIMER2CONTROL_TIMER_SIZE_Pos)  /**< (DUALTIMER_TIMER2CONTROL) 16-bit Counter Position  */
#define DUALTIMER_TIMER2CONTROL_TIMER_SIZE_1 (DUALTIMER_TIMER2CONTROL_TIMER_SIZE_1_Val << DUALTIMER_TIMER2CONTROL_TIMER_SIZE_Pos)  /**< (DUALTIMER_TIMER2CONTROL) 32-bit Counter Position  */
#define DUALTIMER_TIMER2CONTROL_TIMERPRE_Pos 2                                              /**< (DUALTIMER_TIMER2CONTROL) Prescale Bits Position */
#define DUALTIMER_TIMER2CONTROL_TIMERPRE_Msk (0x3u << DUALTIMER_TIMER2CONTROL_TIMERPRE_Pos)  /**< (DUALTIMER_TIMER2CONTROL) Prescale Bits Mask */
#define DUALTIMER_TIMER2CONTROL_TIMERPRE(value) (DUALTIMER_TIMER2CONTROL_TIMERPRE_Msk & ((value) << DUALTIMER_TIMER2CONTROL_TIMERPRE_Pos))
#define   DUALTIMER_TIMER2CONTROL_TIMERPRE_0_Val 0x0u                                           /**< (DUALTIMER_TIMER2CONTROL) 0 Stages, Clock Divided by 1  */
#define   DUALTIMER_TIMER2CONTROL_TIMERPRE_1_Val 0x1u                                           /**< (DUALTIMER_TIMER2CONTROL) 4 Stages, Clock Divided by 16  */
#define   DUALTIMER_TIMER2CONTROL_TIMERPRE_2_Val 0x2u                                           /**< (DUALTIMER_TIMER2CONTROL) 8 Stages, Clock Divided by 256  */
#define   DUALTIMER_TIMER2CONTROL_TIMERPRE_3_Val 0x3u                                           /**< (DUALTIMER_TIMER2CONTROL) Undefined, do not use  */
#define DUALTIMER_TIMER2CONTROL_TIMERPRE_0  (DUALTIMER_TIMER2CONTROL_TIMERPRE_0_Val << DUALTIMER_TIMER2CONTROL_TIMERPRE_Pos)  /**< (DUALTIMER_TIMER2CONTROL) 0 Stages, Clock Divided by 1 Position  */
#define DUALTIMER_TIMER2CONTROL_TIMERPRE_1  (DUALTIMER_TIMER2CONTROL_TIMERPRE_1_Val << DUALTIMER_TIMER2CONTROL_TIMERPRE_Pos)  /**< (DUALTIMER_TIMER2CONTROL) 4 Stages, Clock Divided by 16 Position  */
#define DUALTIMER_TIMER2CONTROL_TIMERPRE_2  (DUALTIMER_TIMER2CONTROL_TIMERPRE_2_Val << DUALTIMER_TIMER2CONTROL_TIMERPRE_Pos)  /**< (DUALTIMER_TIMER2CONTROL) 8 Stages, Clock Divided by 256 Position  */
#define DUALTIMER_TIMER2CONTROL_TIMERPRE_3  (DUALTIMER_TIMER2CONTROL_TIMERPRE_3_Val << DUALTIMER_TIMER2CONTROL_TIMERPRE_Pos)  /**< (DUALTIMER_TIMER2CONTROL) Undefined, do not use Position  */
#define DUALTIMER_TIMER2CONTROL_RESERVED4_Pos 4                                              /**< (DUALTIMER_TIMER2CONTROL) Reserved bit do not use Position */
#define DUALTIMER_TIMER2CONTROL_RESERVED4_Msk (0x1u << DUALTIMER_TIMER2CONTROL_RESERVED4_Pos)  /**< (DUALTIMER_TIMER2CONTROL) Reserved bit do not use Mask */
#define DUALTIMER_TIMER2CONTROL_RESERVED4   DUALTIMER_TIMER2CONTROL_RESERVED4_Msk          /**< \deprecated Old style mask definition for 1 bit bitfield. Use DUALTIMER_TIMER2CONTROL_RESERVED4_Msk instead */
#define DUALTIMER_TIMER2CONTROL_INTERRUPT_ENABLE_Pos 5                                              /**< (DUALTIMER_TIMER2CONTROL) Active High Interrupt Enable Bit Position */
#define DUALTIMER_TIMER2CONTROL_INTERRUPT_ENABLE_Msk (0x1u << DUALTIMER_TIMER2CONTROL_INTERRUPT_ENABLE_Pos)  /**< (DUALTIMER_TIMER2CONTROL) Active High Interrupt Enable Bit Mask */
#define DUALTIMER_TIMER2CONTROL_INTERRUPT_ENABLE DUALTIMER_TIMER2CONTROL_INTERRUPT_ENABLE_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use DUALTIMER_TIMER2CONTROL_INTERRUPT_ENABLE_Msk instead */
#define DUALTIMER_TIMER2CONTROL_TIMER_MODE_Pos 6                                              /**< (DUALTIMER_TIMER2CONTROL) Mode Bit Position */
#define DUALTIMER_TIMER2CONTROL_TIMER_MODE_Msk (0x1u << DUALTIMER_TIMER2CONTROL_TIMER_MODE_Pos)  /**< (DUALTIMER_TIMER2CONTROL) Mode Bit Mask */
#define DUALTIMER_TIMER2CONTROL_TIMER_MODE  DUALTIMER_TIMER2CONTROL_TIMER_MODE_Msk         /**< \deprecated Old style mask definition for 1 bit bitfield. Use DUALTIMER_TIMER2CONTROL_TIMER_MODE_Msk instead */
#define   DUALTIMER_TIMER2CONTROL_TIMER_MODE_0_Val 0x0u                                           /**< (DUALTIMER_TIMER2CONTROL) Free-Running Mode  */
#define   DUALTIMER_TIMER2CONTROL_TIMER_MODE_1_Val 0x1u                                           /**< (DUALTIMER_TIMER2CONTROL) Periodic Mode  */
#define DUALTIMER_TIMER2CONTROL_TIMER_MODE_0 (DUALTIMER_TIMER2CONTROL_TIMER_MODE_0_Val << DUALTIMER_TIMER2CONTROL_TIMER_MODE_Pos)  /**< (DUALTIMER_TIMER2CONTROL) Free-Running Mode Position  */
#define DUALTIMER_TIMER2CONTROL_TIMER_MODE_1 (DUALTIMER_TIMER2CONTROL_TIMER_MODE_1_Val << DUALTIMER_TIMER2CONTROL_TIMER_MODE_Pos)  /**< (DUALTIMER_TIMER2CONTROL) Periodic Mode Position  */
#define DUALTIMER_TIMER2CONTROL_TIMER_ENABLE_Pos 7                                              /**< (DUALTIMER_TIMER2CONTROL) Active High Timer Enable Position */
#define DUALTIMER_TIMER2CONTROL_TIMER_ENABLE_Msk (0x1u << DUALTIMER_TIMER2CONTROL_TIMER_ENABLE_Pos)  /**< (DUALTIMER_TIMER2CONTROL) Active High Timer Enable Mask */
#define DUALTIMER_TIMER2CONTROL_TIMER_ENABLE DUALTIMER_TIMER2CONTROL_TIMER_ENABLE_Msk       /**< \deprecated Old style mask definition for 1 bit bitfield. Use DUALTIMER_TIMER2CONTROL_TIMER_ENABLE_Msk instead */
#define DUALTIMER_TIMER2CONTROL_MASK        0xFFu                                          /**< \deprecated (DUALTIMER_TIMER2CONTROL) Register MASK  (Use DUALTIMER_TIMER2CONTROL_Msk instead)  */
#define DUALTIMER_TIMER2CONTROL_Msk         0xFFu                                          /**< (DUALTIMER_TIMER2CONTROL) Register Mask  */

/* -------- DUALTIMER_TIMER2INTCLR : (DUALTIMER Offset: 0x2c) (/W 8) Timer 2 Interrupt Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  TIMER2INTCLR:1;            /**< bit:      0                                           */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} DUALTIMER_TIMER2INTCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DUALTIMER_TIMER2INTCLR_OFFSET       0x2C                                          /**<  (DUALTIMER_TIMER2INTCLR) Timer 2 Interrupt Clear Register  Offset */
#define DUALTIMER_TIMER2INTCLR_RESETVALUE   0x00u                                         /**<  (DUALTIMER_TIMER2INTCLR) Timer 2 Interrupt Clear Register  Reset Value */

#define DUALTIMER_TIMER2INTCLR_TIMER2INTCLR_Pos 0                                              /**< (DUALTIMER_TIMER2INTCLR)  Position */
#define DUALTIMER_TIMER2INTCLR_TIMER2INTCLR_Msk (0x1u << DUALTIMER_TIMER2INTCLR_TIMER2INTCLR_Pos)  /**< (DUALTIMER_TIMER2INTCLR)  Mask */
#define DUALTIMER_TIMER2INTCLR_TIMER2INTCLR DUALTIMER_TIMER2INTCLR_TIMER2INTCLR_Msk        /**< \deprecated Old style mask definition for 1 bit bitfield. Use DUALTIMER_TIMER2INTCLR_TIMER2INTCLR_Msk instead */
#define DUALTIMER_TIMER2INTCLR_MASK         0x01u                                          /**< \deprecated (DUALTIMER_TIMER2INTCLR) Register MASK  (Use DUALTIMER_TIMER2INTCLR_Msk instead)  */
#define DUALTIMER_TIMER2INTCLR_Msk          0x01u                                          /**< (DUALTIMER_TIMER2INTCLR) Register Mask  */

