remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/dualtimer.h
/* -------- DUALTIMER_TIMER2RIS : (DUALTIMER Offset: 0x30) (R/ 8) Timer 2 Raw Interrupt Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  TIMER2RIS:1;               /**< bit:      0                                           */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} DUALTIMER_TIMER2RIS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DUALTIMER_TIMER2RIS_OFFSET          0x30                                          /**<  (DUALTIMER_TIMER2RIS) Timer 2 Raw Interrupt Status Register  Offset */
#define DUALTIMER_TIMER2RIS_RESETVALUE      0x00u                                         /**<  (DUALTIMER_TIMER2RIS) Timer 2 Raw Interrupt Status Register  Reset Value */

#define DUALTIMER_TIMER2RIS_TIMER2RIS_Pos   0                                              /**< (DUALTIMER_TIMER2RIS)  Position */
#define DUALTIMER_TIMER2RIS_TIMER2RIS_Msk   (0x1u << DUALTIMER_TIMER2RIS_TIMER2RIS_Pos)    /**< (DUALTIMER_TIMER2RIS)  Mask */
#define DUALTIMER_TIMER2RIS_TIMER2RIS       DUALTIMER_TIMER2RIS_TIMER2RIS_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use DUALTIMER_TIMER2RIS_TIMER2RIS_Msk instead */
#define DUALTIMER_TIMER2RIS_MASK            0x01u                                          /**< \deprecated (DUALTIMER_TIMER2RIS) Register MASK  (Use DUALTIMER_TIMER2RIS_Msk instead)  */
#define DUALTIMER_TIMER2RIS_Msk             0x01u                                          /**< (DUALTIMER_TIMER2RIS) Register Mask  */

/* -------- DUALTIMER_TIMER2MIS : (DUALTIMER Offset: 0x34) (R/ 8) Timer 2 Masked Interrupt Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  TIMER2MIS:1;               /**< bit:      0                                           */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} DUALTIMER_TIMER2MIS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DUALTIMER_TIMER2MIS_OFFSET          0x34                                          /**<  (DUALTIMER_TIMER2MIS) Timer 2 Masked Interrupt Status Register  Offset */
#define DUALTIMER_TIMER2MIS_RESETVALUE      0x00u                                         /**<  (DUALTIMER_TIMER2MIS) Timer 2 Masked Interrupt Status Register  Reset Value */

#define DUALTIMER_TIMER2MIS_TIMER2MIS_Pos   0                                              /**< (DUALTIMER_TIMER2MIS)  Position */
#define DUALTIMER_TIMER2MIS_TIMER2MIS_Msk   (0x1u << DUALTIMER_TIMER2MIS_TIMER2MIS_Pos)    /**< (DUALTIMER_TIMER2MIS)  Mask */
#define DUALTIMER_TIMER2MIS_TIMER2MIS       DUALTIMER_TIMER2MIS_TIMER2MIS_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use DUALTIMER_TIMER2MIS_TIMER2MIS_Msk instead */
#define DUALTIMER_TIMER2MIS_MASK            0x01u                                          /**< \deprecated (DUALTIMER_TIMER2MIS) Register MASK  (Use DUALTIMER_TIMER2MIS_Msk instead)  */
#define DUALTIMER_TIMER2MIS_Msk             0x01u                                          /**< (DUALTIMER_TIMER2MIS) Register Mask  */

/* -------- DUALTIMER_TIMER2BGLOAD : (DUALTIMER Offset: 0x38) (R/W 32) Timer 2 Background Load Register (Reload Value for Period Mode) -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TIMER2BGLOAD:32;           /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} DUALTIMER_TIMER2BGLOAD_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DUALTIMER_TIMER2BGLOAD_OFFSET       0x38                                          /**<  (DUALTIMER_TIMER2BGLOAD) Timer 2 Background Load Register (Reload Value for Period Mode)  Offset */
#define DUALTIMER_TIMER2BGLOAD_RESETVALUE   0x00u                                         /**<  (DUALTIMER_TIMER2BGLOAD) Timer 2 Background Load Register (Reload Value for Period Mode)  Reset Value */

#define DUALTIMER_TIMER2BGLOAD_TIMER2BGLOAD_Pos 0                                              /**< (DUALTIMER_TIMER2BGLOAD)  Position */
#define DUALTIMER_TIMER2BGLOAD_TIMER2BGLOAD_Msk (0xFFFFFFFFu << DUALTIMER_TIMER2BGLOAD_TIMER2BGLOAD_Pos)  /**< (DUALTIMER_TIMER2BGLOAD)  Mask */
#define DUALTIMER_TIMER2BGLOAD_TIMER2BGLOAD(value) (DUALTIMER_TIMER2BGLOAD_TIMER2BGLOAD_Msk & ((value) << DUALTIMER_TIMER2BGLOAD_TIMER2BGLOAD_Pos))
#define DUALTIMER_TIMER2BGLOAD_MASK         0xFFFFFFFFu                                    /**< \deprecated (DUALTIMER_TIMER2BGLOAD) Register MASK  (Use DUALTIMER_TIMER2BGLOAD_Msk instead)  */
#define DUALTIMER_TIMER2BGLOAD_Msk          0xFFFFFFFFu                                    /**< (DUALTIMER_TIMER2BGLOAD) Register Mask  */

/* -------- DUALTIMER_TIMERITCR : (DUALTIMER Offset: 0xf00) (R/W 8) Integration Test Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  TIMERITCR:1;               /**< bit:      0                                           */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} DUALTIMER_TIMERITCR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DUALTIMER_TIMERITCR_OFFSET          0xF00                                         /**<  (DUALTIMER_TIMERITCR) Integration Test Control Register  Offset */
#define DUALTIMER_TIMERITCR_RESETVALUE      0x00u                                         /**<  (DUALTIMER_TIMERITCR) Integration Test Control Register  Reset Value */

#define DUALTIMER_TIMERITCR_TIMERITCR_Pos   0                                              /**< (DUALTIMER_TIMERITCR)  Position */
#define DUALTIMER_TIMERITCR_TIMERITCR_Msk   (0x1u << DUALTIMER_TIMERITCR_TIMERITCR_Pos)    /**< (DUALTIMER_TIMERITCR)  Mask */
#define DUALTIMER_TIMERITCR_TIMERITCR       DUALTIMER_TIMERITCR_TIMERITCR_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use DUALTIMER_TIMERITCR_TIMERITCR_Msk instead */
#define DUALTIMER_TIMERITCR_MASK            0x01u                                          /**< \deprecated (DUALTIMER_TIMERITCR) Register MASK  (Use DUALTIMER_TIMERITCR_Msk instead)  */
#define DUALTIMER_TIMERITCR_Msk             0x01u                                          /**< (DUALTIMER_TIMERITCR) Register Mask  */

