remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/dualtimer.h
/* -------- DUALTIMER_TIMERITOP : (DUALTIMER Offset: 0xf04) (/W 8) Integration Test Output Set Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  INT_TEST_TIMINT1_VALUE:1;  /**< bit:      0  Value Output on TIMINT1 in Integration Test Mode */
    uint8_t  INT_TEST_TIMING2_VALUE:1;  /**< bit:      1  Value Output on TIMINT2 in Integration Test Mode */
    uint8_t  :6;                        /**< bit:   2..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} DUALTIMER_TIMERITOP_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DUALTIMER_TIMERITOP_OFFSET          0xF04                                         /**<  (DUALTIMER_TIMERITOP) Integration Test Output Set Register  Offset */
#define DUALTIMER_TIMERITOP_RESETVALUE      0x00u                                         /**<  (DUALTIMER_TIMERITOP) Integration Test Output Set Register  Reset Value */

#define DUALTIMER_TIMERITOP_INT_TEST_TIMINT1_VALUE_Pos 0                                              /**< (DUALTIMER_TIMERITOP) Value Output on TIMINT1 in Integration Test Mode Position */
#define DUALTIMER_TIMERITOP_INT_TEST_TIMINT1_VALUE_Msk (0x1u << DUALTIMER_TIMERITOP_INT_TEST_TIMINT1_VALUE_Pos)  /**< (DUALTIMER_TIMERITOP) Value Output on TIMINT1 in Integration Test Mode Mask */
#define DUALTIMER_TIMERITOP_INT_TEST_TIMINT1_VALUE DUALTIMER_TIMERITOP_INT_TEST_TIMINT1_VALUE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use DUALTIMER_TIMERITOP_INT_TEST_TIMINT1_VALUE_Msk instead */
#define DUALTIMER_TIMERITOP_INT_TEST_TIMING2_VALUE_Pos 1                                              /**< (DUALTIMER_TIMERITOP) Value Output on TIMINT2 in Integration Test Mode Position */
#define DUALTIMER_TIMERITOP_INT_TEST_TIMING2_VALUE_Msk (0x1u << DUALTIMER_TIMERITOP_INT_TEST_TIMING2_VALUE_Pos)  /**< (DUALTIMER_TIMERITOP) Value Output on TIMINT2 in Integration Test Mode Mask */
#define DUALTIMER_TIMERITOP_INT_TEST_TIMING2_VALUE DUALTIMER_TIMERITOP_INT_TEST_TIMING2_VALUE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use DUALTIMER_TIMERITOP_INT_TEST_TIMING2_VALUE_Msk instead */
#define DUALTIMER_TIMERITOP_MASK            0x03u                                          /**< \deprecated (DUALTIMER_TIMERITOP) Register MASK  (Use DUALTIMER_TIMERITOP_Msk instead)  */
#define DUALTIMER_TIMERITOP_Msk             0x03u                                          /**< (DUALTIMER_TIMERITOP) Register Mask  */

/* -------- DUALTIMER_TIMERPERIPHID4 : (DUALTIMER Offset: 0xfd0) (R/ 8) Peripheral ID Register 4 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  JEP106_C_CODE:4;           /**< bit:   0..3  JEP106 C Code                            */
    uint8_t  BLOCK_COUNT:4;             /**< bit:   4..7  Block Count                              */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} DUALTIMER_TIMERPERIPHID4_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DUALTIMER_TIMERPERIPHID4_OFFSET     0xFD0                                         /**<  (DUALTIMER_TIMERPERIPHID4) Peripheral ID Register 4  Offset */
#define DUALTIMER_TIMERPERIPHID4_RESETVALUE 0x04u                                         /**<  (DUALTIMER_TIMERPERIPHID4) Peripheral ID Register 4  Reset Value */

#define DUALTIMER_TIMERPERIPHID4_JEP106_C_CODE_Pos 0                                              /**< (DUALTIMER_TIMERPERIPHID4) JEP106 C Code Position */
#define DUALTIMER_TIMERPERIPHID4_JEP106_C_CODE_Msk (0xFu << DUALTIMER_TIMERPERIPHID4_JEP106_C_CODE_Pos)  /**< (DUALTIMER_TIMERPERIPHID4) JEP106 C Code Mask */
#define DUALTIMER_TIMERPERIPHID4_JEP106_C_CODE(value) (DUALTIMER_TIMERPERIPHID4_JEP106_C_CODE_Msk & ((value) << DUALTIMER_TIMERPERIPHID4_JEP106_C_CODE_Pos))
#define DUALTIMER_TIMERPERIPHID4_BLOCK_COUNT_Pos 4                                              /**< (DUALTIMER_TIMERPERIPHID4) Block Count Position */
#define DUALTIMER_TIMERPERIPHID4_BLOCK_COUNT_Msk (0xFu << DUALTIMER_TIMERPERIPHID4_BLOCK_COUNT_Pos)  /**< (DUALTIMER_TIMERPERIPHID4) Block Count Mask */
#define DUALTIMER_TIMERPERIPHID4_BLOCK_COUNT(value) (DUALTIMER_TIMERPERIPHID4_BLOCK_COUNT_Msk & ((value) << DUALTIMER_TIMERPERIPHID4_BLOCK_COUNT_Pos))
#define DUALTIMER_TIMERPERIPHID4_MASK       0xFFu                                          /**< \deprecated (DUALTIMER_TIMERPERIPHID4) Register MASK  (Use DUALTIMER_TIMERPERIPHID4_Msk instead)  */
#define DUALTIMER_TIMERPERIPHID4_Msk        0xFFu                                          /**< (DUALTIMER_TIMERPERIPHID4) Register Mask  */

/* -------- DUALTIMER_TIMERPERIPHID5 : (DUALTIMER Offset: 0xfd4) (R/ 8) Peripheral ID Register 5 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  TIMERPERIPHID5:8;          /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} DUALTIMER_TIMERPERIPHID5_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DUALTIMER_TIMERPERIPHID5_OFFSET     0xFD4                                         /**<  (DUALTIMER_TIMERPERIPHID5) Peripheral ID Register 5  Offset */
#define DUALTIMER_TIMERPERIPHID5_RESETVALUE 0x00u                                         /**<  (DUALTIMER_TIMERPERIPHID5) Peripheral ID Register 5  Reset Value */

#define DUALTIMER_TIMERPERIPHID5_TIMERPERIPHID5_Pos 0                                              /**< (DUALTIMER_TIMERPERIPHID5)  Position */
#define DUALTIMER_TIMERPERIPHID5_TIMERPERIPHID5_Msk (0xFFu << DUALTIMER_TIMERPERIPHID5_TIMERPERIPHID5_Pos)  /**< (DUALTIMER_TIMERPERIPHID5)  Mask */
#define DUALTIMER_TIMERPERIPHID5_TIMERPERIPHID5(value) (DUALTIMER_TIMERPERIPHID5_TIMERPERIPHID5_Msk & ((value) << DUALTIMER_TIMERPERIPHID5_TIMERPERIPHID5_Pos))
#define DUALTIMER_TIMERPERIPHID5_MASK       0xFFu                                          /**< \deprecated (DUALTIMER_TIMERPERIPHID5) Register MASK  (Use DUALTIMER_TIMERPERIPHID5_Msk instead)  */
#define DUALTIMER_TIMERPERIPHID5_Msk        0xFFu                                          /**< (DUALTIMER_TIMERPERIPHID5) Register Mask  */

/* -------- DUALTIMER_TIMERPERIPHID6 : (DUALTIMER Offset: 0xfd8) (R/ 8) Peripheral ID Register 6 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  TIMERPERIPHID6:8;          /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} DUALTIMER_TIMERPERIPHID6_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DUALTIMER_TIMERPERIPHID6_OFFSET     0xFD8                                         /**<  (DUALTIMER_TIMERPERIPHID6) Peripheral ID Register 6  Offset */
#define DUALTIMER_TIMERPERIPHID6_RESETVALUE 0x00u                                         /**<  (DUALTIMER_TIMERPERIPHID6) Peripheral ID Register 6  Reset Value */

#define DUALTIMER_TIMERPERIPHID6_TIMERPERIPHID6_Pos 0                                              /**< (DUALTIMER_TIMERPERIPHID6)  Position */
#define DUALTIMER_TIMERPERIPHID6_TIMERPERIPHID6_Msk (0xFFu << DUALTIMER_TIMERPERIPHID6_TIMERPERIPHID6_Pos)  /**< (DUALTIMER_TIMERPERIPHID6)  Mask */
#define DUALTIMER_TIMERPERIPHID6_TIMERPERIPHID6(value) (DUALTIMER_TIMERPERIPHID6_TIMERPERIPHID6_Msk & ((value) << DUALTIMER_TIMERPERIPHID6_TIMERPERIPHID6_Pos))
#define DUALTIMER_TIMERPERIPHID6_MASK       0xFFu                                          /**< \deprecated (DUALTIMER_TIMERPERIPHID6) Register MASK  (Use DUALTIMER_TIMERPERIPHID6_Msk instead)  */
#define DUALTIMER_TIMERPERIPHID6_Msk        0xFFu                                          /**< (DUALTIMER_TIMERPERIPHID6) Register Mask  */

/* -------- DUALTIMER_TIMERPERIPHID7 : (DUALTIMER Offset: 0xfdc) (R/ 8) Peripheral ID Register 7 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  TIMERPERIPHID7:8;          /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} DUALTIMER_TIMERPERIPHID7_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

