remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/dualtimer.h
#define DUALTIMER_TIMERPERIPHID7_OFFSET     0xFDC                                         /**<  (DUALTIMER_TIMERPERIPHID7) Peripheral ID Register 7  Offset */
#define DUALTIMER_TIMERPERIPHID7_RESETVALUE 0x00u                                         /**<  (DUALTIMER_TIMERPERIPHID7) Peripheral ID Register 7  Reset Value */

#define DUALTIMER_TIMERPERIPHID7_TIMERPERIPHID7_Pos 0                                              /**< (DUALTIMER_TIMERPERIPHID7)  Position */
#define DUALTIMER_TIMERPERIPHID7_TIMERPERIPHID7_Msk (0xFFu << DUALTIMER_TIMERPERIPHID7_TIMERPERIPHID7_Pos)  /**< (DUALTIMER_TIMERPERIPHID7)  Mask */
#define DUALTIMER_TIMERPERIPHID7_TIMERPERIPHID7(value) (DUALTIMER_TIMERPERIPHID7_TIMERPERIPHID7_Msk & ((value) << DUALTIMER_TIMERPERIPHID7_TIMERPERIPHID7_Pos))
#define DUALTIMER_TIMERPERIPHID7_MASK       0xFFu                                          /**< \deprecated (DUALTIMER_TIMERPERIPHID7) Register MASK  (Use DUALTIMER_TIMERPERIPHID7_Msk instead)  */
#define DUALTIMER_TIMERPERIPHID7_Msk        0xFFu                                          /**< (DUALTIMER_TIMERPERIPHID7) Register Mask  */

/* -------- DUALTIMER_TIMERPERIPHID0 : (DUALTIMER Offset: 0xfe0) (R/ 8) Peripheral ID Register 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  PART_NUMBER:8;             /**< bit:   0..7  Part Number Bits 7:0                     */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} DUALTIMER_TIMERPERIPHID0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DUALTIMER_TIMERPERIPHID0_OFFSET     0xFE0                                         /**<  (DUALTIMER_TIMERPERIPHID0) Peripheral ID Register 0  Offset */
#define DUALTIMER_TIMERPERIPHID0_RESETVALUE 0x23u                                         /**<  (DUALTIMER_TIMERPERIPHID0) Peripheral ID Register 0  Reset Value */

#define DUALTIMER_TIMERPERIPHID0_PART_NUMBER_Pos 0                                              /**< (DUALTIMER_TIMERPERIPHID0) Part Number Bits 7:0 Position */
#define DUALTIMER_TIMERPERIPHID0_PART_NUMBER_Msk (0xFFu << DUALTIMER_TIMERPERIPHID0_PART_NUMBER_Pos)  /**< (DUALTIMER_TIMERPERIPHID0) Part Number Bits 7:0 Mask */
#define DUALTIMER_TIMERPERIPHID0_PART_NUMBER(value) (DUALTIMER_TIMERPERIPHID0_PART_NUMBER_Msk & ((value) << DUALTIMER_TIMERPERIPHID0_PART_NUMBER_Pos))
#define DUALTIMER_TIMERPERIPHID0_MASK       0xFFu                                          /**< \deprecated (DUALTIMER_TIMERPERIPHID0) Register MASK  (Use DUALTIMER_TIMERPERIPHID0_Msk instead)  */
#define DUALTIMER_TIMERPERIPHID0_Msk        0xFFu                                          /**< (DUALTIMER_TIMERPERIPHID0) Register Mask  */

/* -------- DUALTIMER_TIMERPERIPHID1 : (DUALTIMER Offset: 0xfe4) (R/ 8) Peripheral ID Register 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  PART_NUMBER:4;             /**< bit:   0..3  Part Number Bits 11:8                    */
    uint8_t  JEP106_ID_3_0:4;           /**< bit:   4..7  JEP106 ID Bits 3:0                       */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} DUALTIMER_TIMERPERIPHID1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DUALTIMER_TIMERPERIPHID1_OFFSET     0xFE4                                         /**<  (DUALTIMER_TIMERPERIPHID1) Peripheral ID Register 1  Offset */
#define DUALTIMER_TIMERPERIPHID1_RESETVALUE 0xB8u                                         /**<  (DUALTIMER_TIMERPERIPHID1) Peripheral ID Register 1  Reset Value */

#define DUALTIMER_TIMERPERIPHID1_PART_NUMBER_Pos 0                                              /**< (DUALTIMER_TIMERPERIPHID1) Part Number Bits 11:8 Position */
#define DUALTIMER_TIMERPERIPHID1_PART_NUMBER_Msk (0xFu << DUALTIMER_TIMERPERIPHID1_PART_NUMBER_Pos)  /**< (DUALTIMER_TIMERPERIPHID1) Part Number Bits 11:8 Mask */
#define DUALTIMER_TIMERPERIPHID1_PART_NUMBER(value) (DUALTIMER_TIMERPERIPHID1_PART_NUMBER_Msk & ((value) << DUALTIMER_TIMERPERIPHID1_PART_NUMBER_Pos))
#define DUALTIMER_TIMERPERIPHID1_JEP106_ID_3_0_Pos 4                                              /**< (DUALTIMER_TIMERPERIPHID1) JEP106 ID Bits 3:0 Position */
#define DUALTIMER_TIMERPERIPHID1_JEP106_ID_3_0_Msk (0xFu << DUALTIMER_TIMERPERIPHID1_JEP106_ID_3_0_Pos)  /**< (DUALTIMER_TIMERPERIPHID1) JEP106 ID Bits 3:0 Mask */
#define DUALTIMER_TIMERPERIPHID1_JEP106_ID_3_0(value) (DUALTIMER_TIMERPERIPHID1_JEP106_ID_3_0_Msk & ((value) << DUALTIMER_TIMERPERIPHID1_JEP106_ID_3_0_Pos))
#define DUALTIMER_TIMERPERIPHID1_MASK       0xFFu                                          /**< \deprecated (DUALTIMER_TIMERPERIPHID1) Register MASK  (Use DUALTIMER_TIMERPERIPHID1_Msk instead)  */
#define DUALTIMER_TIMERPERIPHID1_Msk        0xFFu                                          /**< (DUALTIMER_TIMERPERIPHID1) Register Mask  */

/* -------- DUALTIMER_TIMERPERIPHID2 : (DUALTIMER Offset: 0xfe8) (R/ 8) Peripheral ID Register 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  JEP106_ID_6_4:3;           /**< bit:   0..2  JEP106 ID Bits 6:4                       */
    uint8_t  JEDEC_USED:1;              /**< bit:      3  JEDEC Used                               */
    uint8_t  REVISION:4;                /**< bit:   4..7  Revision                                 */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} DUALTIMER_TIMERPERIPHID2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DUALTIMER_TIMERPERIPHID2_OFFSET     0xFE8                                         /**<  (DUALTIMER_TIMERPERIPHID2) Peripheral ID Register 2  Offset */
#define DUALTIMER_TIMERPERIPHID2_RESETVALUE 0x1Bu                                         /**<  (DUALTIMER_TIMERPERIPHID2) Peripheral ID Register 2  Reset Value */

#define DUALTIMER_TIMERPERIPHID2_JEP106_ID_6_4_Pos 0                                              /**< (DUALTIMER_TIMERPERIPHID2) JEP106 ID Bits 6:4 Position */
#define DUALTIMER_TIMERPERIPHID2_JEP106_ID_6_4_Msk (0x7u << DUALTIMER_TIMERPERIPHID2_JEP106_ID_6_4_Pos)  /**< (DUALTIMER_TIMERPERIPHID2) JEP106 ID Bits 6:4 Mask */
#define DUALTIMER_TIMERPERIPHID2_JEP106_ID_6_4(value) (DUALTIMER_TIMERPERIPHID2_JEP106_ID_6_4_Msk & ((value) << DUALTIMER_TIMERPERIPHID2_JEP106_ID_6_4_Pos))
#define DUALTIMER_TIMERPERIPHID2_JEDEC_USED_Pos 3                                              /**< (DUALTIMER_TIMERPERIPHID2) JEDEC Used Position */
#define DUALTIMER_TIMERPERIPHID2_JEDEC_USED_Msk (0x1u << DUALTIMER_TIMERPERIPHID2_JEDEC_USED_Pos)  /**< (DUALTIMER_TIMERPERIPHID2) JEDEC Used Mask */
#define DUALTIMER_TIMERPERIPHID2_JEDEC_USED DUALTIMER_TIMERPERIPHID2_JEDEC_USED_Msk        /**< \deprecated Old style mask definition for 1 bit bitfield. Use DUALTIMER_TIMERPERIPHID2_JEDEC_USED_Msk instead */
#define DUALTIMER_TIMERPERIPHID2_REVISION_Pos 4                                              /**< (DUALTIMER_TIMERPERIPHID2) Revision Position */
#define DUALTIMER_TIMERPERIPHID2_REVISION_Msk (0xFu << DUALTIMER_TIMERPERIPHID2_REVISION_Pos)  /**< (DUALTIMER_TIMERPERIPHID2) Revision Mask */
#define DUALTIMER_TIMERPERIPHID2_REVISION(value) (DUALTIMER_TIMERPERIPHID2_REVISION_Msk & ((value) << DUALTIMER_TIMERPERIPHID2_REVISION_Pos))
#define DUALTIMER_TIMERPERIPHID2_MASK       0xFFu                                          /**< \deprecated (DUALTIMER_TIMERPERIPHID2) Register MASK  (Use DUALTIMER_TIMERPERIPHID2_Msk instead)  */
#define DUALTIMER_TIMERPERIPHID2_Msk        0xFFu                                          /**< (DUALTIMER_TIMERPERIPHID2) Register Mask  */

/* -------- DUALTIMER_TIMERPERIPHID3 : (DUALTIMER Offset: 0xfec) (R/ 8) Peripheral ID Register 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CUSTOMER_MOD_NUMBER:4;     /**< bit:   0..3  Customer Modification Number             */
    uint8_t  ECO_REV_NUMBER:4;          /**< bit:   4..7  ECO Revision Number                      */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} DUALTIMER_TIMERPERIPHID3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

