remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/dualtimer.h
#define DUALTIMER_TIMERPERIPHID3_OFFSET     0xFEC                                         /**<  (DUALTIMER_TIMERPERIPHID3) Peripheral ID Register 3  Offset */
#define DUALTIMER_TIMERPERIPHID3_RESETVALUE 0x00u                                         /**<  (DUALTIMER_TIMERPERIPHID3) Peripheral ID Register 3  Reset Value */

#define DUALTIMER_TIMERPERIPHID3_CUSTOMER_MOD_NUMBER_Pos 0                                              /**< (DUALTIMER_TIMERPERIPHID3) Customer Modification Number Position */
#define DUALTIMER_TIMERPERIPHID3_CUSTOMER_MOD_NUMBER_Msk (0xFu << DUALTIMER_TIMERPERIPHID3_CUSTOMER_MOD_NUMBER_Pos)  /**< (DUALTIMER_TIMERPERIPHID3) Customer Modification Number Mask */
#define DUALTIMER_TIMERPERIPHID3_CUSTOMER_MOD_NUMBER(value) (DUALTIMER_TIMERPERIPHID3_CUSTOMER_MOD_NUMBER_Msk & ((value) << DUALTIMER_TIMERPERIPHID3_CUSTOMER_MOD_NUMBER_Pos))
#define DUALTIMER_TIMERPERIPHID3_ECO_REV_NUMBER_Pos 4                                              /**< (DUALTIMER_TIMERPERIPHID3) ECO Revision Number Position */
#define DUALTIMER_TIMERPERIPHID3_ECO_REV_NUMBER_Msk (0xFu << DUALTIMER_TIMERPERIPHID3_ECO_REV_NUMBER_Pos)  /**< (DUALTIMER_TIMERPERIPHID3) ECO Revision Number Mask */
#define DUALTIMER_TIMERPERIPHID3_ECO_REV_NUMBER(value) (DUALTIMER_TIMERPERIPHID3_ECO_REV_NUMBER_Msk & ((value) << DUALTIMER_TIMERPERIPHID3_ECO_REV_NUMBER_Pos))
#define DUALTIMER_TIMERPERIPHID3_MASK       0xFFu                                          /**< \deprecated (DUALTIMER_TIMERPERIPHID3) Register MASK  (Use DUALTIMER_TIMERPERIPHID3_Msk instead)  */
#define DUALTIMER_TIMERPERIPHID3_Msk        0xFFu                                          /**< (DUALTIMER_TIMERPERIPHID3) Register Mask  */

/* -------- DUALTIMER_TIMERPCELLID0 : (DUALTIMER Offset: 0xff0) (R/ 8) Component ID Register 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  TIMERPCELLID0:8;           /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} DUALTIMER_TIMERPCELLID0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DUALTIMER_TIMERPCELLID0_OFFSET      0xFF0                                         /**<  (DUALTIMER_TIMERPCELLID0) Component ID Register 0  Offset */
#define DUALTIMER_TIMERPCELLID0_RESETVALUE  0x0Du                                         /**<  (DUALTIMER_TIMERPCELLID0) Component ID Register 0  Reset Value */

#define DUALTIMER_TIMERPCELLID0_TIMERPCELLID0_Pos 0                                              /**< (DUALTIMER_TIMERPCELLID0)  Position */
#define DUALTIMER_TIMERPCELLID0_TIMERPCELLID0_Msk (0xFFu << DUALTIMER_TIMERPCELLID0_TIMERPCELLID0_Pos)  /**< (DUALTIMER_TIMERPCELLID0)  Mask */
#define DUALTIMER_TIMERPCELLID0_TIMERPCELLID0(value) (DUALTIMER_TIMERPCELLID0_TIMERPCELLID0_Msk & ((value) << DUALTIMER_TIMERPCELLID0_TIMERPCELLID0_Pos))
#define DUALTIMER_TIMERPCELLID0_MASK        0xFFu                                          /**< \deprecated (DUALTIMER_TIMERPCELLID0) Register MASK  (Use DUALTIMER_TIMERPCELLID0_Msk instead)  */
#define DUALTIMER_TIMERPCELLID0_Msk         0xFFu                                          /**< (DUALTIMER_TIMERPCELLID0) Register Mask  */

/* -------- DUALTIMER_TIMERPCELLID1 : (DUALTIMER Offset: 0xff4) (R/ 8) Component ID Register 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  TIMERPCELLID1:8;           /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} DUALTIMER_TIMERPCELLID1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DUALTIMER_TIMERPCELLID1_OFFSET      0xFF4                                         /**<  (DUALTIMER_TIMERPCELLID1) Component ID Register 1  Offset */
#define DUALTIMER_TIMERPCELLID1_RESETVALUE  0xF0u                                         /**<  (DUALTIMER_TIMERPCELLID1) Component ID Register 1  Reset Value */

#define DUALTIMER_TIMERPCELLID1_TIMERPCELLID1_Pos 0                                              /**< (DUALTIMER_TIMERPCELLID1)  Position */
#define DUALTIMER_TIMERPCELLID1_TIMERPCELLID1_Msk (0xFFu << DUALTIMER_TIMERPCELLID1_TIMERPCELLID1_Pos)  /**< (DUALTIMER_TIMERPCELLID1)  Mask */
#define DUALTIMER_TIMERPCELLID1_TIMERPCELLID1(value) (DUALTIMER_TIMERPCELLID1_TIMERPCELLID1_Msk & ((value) << DUALTIMER_TIMERPCELLID1_TIMERPCELLID1_Pos))
#define DUALTIMER_TIMERPCELLID1_MASK        0xFFu                                          /**< \deprecated (DUALTIMER_TIMERPCELLID1) Register MASK  (Use DUALTIMER_TIMERPCELLID1_Msk instead)  */
#define DUALTIMER_TIMERPCELLID1_Msk         0xFFu                                          /**< (DUALTIMER_TIMERPCELLID1) Register Mask  */

/* -------- DUALTIMER_TIMERPCELLID2 : (DUALTIMER Offset: 0xff8) (R/ 8) Component ID Register 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  TIMERPCELLID2:8;           /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} DUALTIMER_TIMERPCELLID2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DUALTIMER_TIMERPCELLID2_OFFSET      0xFF8                                         /**<  (DUALTIMER_TIMERPCELLID2) Component ID Register 2  Offset */
#define DUALTIMER_TIMERPCELLID2_RESETVALUE  0x05u                                         /**<  (DUALTIMER_TIMERPCELLID2) Component ID Register 2  Reset Value */

#define DUALTIMER_TIMERPCELLID2_TIMERPCELLID2_Pos 0                                              /**< (DUALTIMER_TIMERPCELLID2)  Position */
#define DUALTIMER_TIMERPCELLID2_TIMERPCELLID2_Msk (0xFFu << DUALTIMER_TIMERPCELLID2_TIMERPCELLID2_Pos)  /**< (DUALTIMER_TIMERPCELLID2)  Mask */
#define DUALTIMER_TIMERPCELLID2_TIMERPCELLID2(value) (DUALTIMER_TIMERPCELLID2_TIMERPCELLID2_Msk & ((value) << DUALTIMER_TIMERPCELLID2_TIMERPCELLID2_Pos))
#define DUALTIMER_TIMERPCELLID2_MASK        0xFFu                                          /**< \deprecated (DUALTIMER_TIMERPCELLID2) Register MASK  (Use DUALTIMER_TIMERPCELLID2_Msk instead)  */
#define DUALTIMER_TIMERPCELLID2_Msk         0xFFu                                          /**< (DUALTIMER_TIMERPCELLID2) Register Mask  */

/* -------- DUALTIMER_TIMERPCELLID3 : (DUALTIMER Offset: 0xffc) (R/ 8) Component ID Register 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  TIMERPCELLID3:8;           /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} DUALTIMER_TIMERPCELLID3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DUALTIMER_TIMERPCELLID3_OFFSET      0xFFC                                         /**<  (DUALTIMER_TIMERPCELLID3) Component ID Register 3  Offset */
#define DUALTIMER_TIMERPCELLID3_RESETVALUE  0xB1u                                         /**<  (DUALTIMER_TIMERPCELLID3) Component ID Register 3  Reset Value */

#define DUALTIMER_TIMERPCELLID3_TIMERPCELLID3_Pos 0                                              /**< (DUALTIMER_TIMERPCELLID3)  Position */
#define DUALTIMER_TIMERPCELLID3_TIMERPCELLID3_Msk (0xFFu << DUALTIMER_TIMERPCELLID3_TIMERPCELLID3_Pos)  /**< (DUALTIMER_TIMERPCELLID3)  Mask */
#define DUALTIMER_TIMERPCELLID3_TIMERPCELLID3(value) (DUALTIMER_TIMERPCELLID3_TIMERPCELLID3_Msk & ((value) << DUALTIMER_TIMERPCELLID3_TIMERPCELLID3_Pos))
#define DUALTIMER_TIMERPCELLID3_MASK        0xFFu                                          /**< \deprecated (DUALTIMER_TIMERPCELLID3) Register MASK  (Use DUALTIMER_TIMERPCELLID3_Msk instead)  */
#define DUALTIMER_TIMERPCELLID3_Msk         0xFFu                                          /**< (DUALTIMER_TIMERPCELLID3) Register Mask  */

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief DUALTIMER hardware registers */
typedef struct {  /* ARM General Purpose Dual Timer */
  RwReg   TIMER1LOAD;     /**< (DUALTIMER Offset: 0x00) Timer 1 Load Register */
  RoReg   TIMER1VALUE;    /**< (DUALTIMER Offset: 0x04) Timer 1 Current Value Register */
  RwReg8  TIMER1CONTROL;  /**< (DUALTIMER Offset: 0x08) Timer 1 Control Register */
  __I  uint8_t  Reserved1[3];
  WoReg8  TIMER1INTCLR;   /**< (DUALTIMER Offset: 0x0C) Timer 1 Interrupt Clear Register */
  __I  uint8_t  Reserved2[3];
  RoReg8  TIMER1RIS;      /**< (DUALTIMER Offset: 0x10) Timer 1 Raw Interrupt Status Register */
  __I  uint8_t  Reserved3[3];
  RoReg8  TIMER1MIS;      /**< (DUALTIMER Offset: 0x14) Timer 1 Masked Interrupt Status Register */
  __I  uint8_t  Reserved4[3];
  RwReg   TIMER1BGLOAD;   /**< (DUALTIMER Offset: 0x18) Timer 1 Background Load Register (Reload Value for Period Mode) */
  __I  uint32_t Reserved5[1];
  RwReg   TIMER2LOAD;     /**< (DUALTIMER Offset: 0x20) Timer 2 Load Register */
  RoReg   TIMER2VALUE;    /**< (DUALTIMER Offset: 0x24) Timer 2 Current Value Register */
  RwReg8  TIMER2CONTROL;  /**< (DUALTIMER Offset: 0x28) Timer 2 Control Register */
  __I  uint8_t  Reserved6[3];
  WoReg8  TIMER2INTCLR;   /**< (DUALTIMER Offset: 0x2C) Timer 2 Interrupt Clear Register */
  __I  uint8_t  Reserved7[3];
  RoReg8  TIMER2RIS;      /**< (DUALTIMER Offset: 0x30) Timer 2 Raw Interrupt Status Register */
  __I  uint8_t  Reserved8[3];
  RoReg8  TIMER2MIS;      /**< (DUALTIMER Offset: 0x34) Timer 2 Masked Interrupt Status Register */
  __I  uint8_t  Reserved9[3];
  RwReg   TIMER2BGLOAD;   /**< (DUALTIMER Offset: 0x38) Timer 2 Background Load Register (Reload Value for Period Mode) */
  __I  uint32_t Reserved10[945];
  RwReg8  TIMERITCR;      /**< (DUALTIMER Offset: 0xF00) Integration Test Control Register */
  __I  uint8_t  Reserved11[3];
  WoReg8  TIMERITOP;      /**< (DUALTIMER Offset: 0xF04) Integration Test Output Set Register */
  __I  uint8_t  Reserved12[203];
  RoReg8  TIMERPERIPHID4; /**< (DUALTIMER Offset: 0xFD0) Peripheral ID Register 4 */
  __I  uint8_t  Reserved13[3];
  RoReg8  TIMERPERIPHID5; /**< (DUALTIMER Offset: 0xFD4) Peripheral ID Register 5 */
  __I  uint8_t  Reserved14[3];
  RoReg8  TIMERPERIPHID6; /**< (DUALTIMER Offset: 0xFD8) Peripheral ID Register 6 */
  __I  uint8_t  Reserved15[3];
  RoReg8  TIMERPERIPHID7; /**< (DUALTIMER Offset: 0xFDC) Peripheral ID Register 7 */
  __I  uint8_t  Reserved16[3];
  RoReg8  TIMERPERIPHID0; /**< (DUALTIMER Offset: 0xFE0) Peripheral ID Register 0 */
  __I  uint8_t  Reserved17[3];
  RoReg8  TIMERPERIPHID1; /**< (DUALTIMER Offset: 0xFE4) Peripheral ID Register 1 */
  __I  uint8_t  Reserved18[3];
  RoReg8  TIMERPERIPHID2; /**< (DUALTIMER Offset: 0xFE8) Peripheral ID Register 2 */
  __I  uint8_t  Reserved19[3];
  RoReg8  TIMERPERIPHID3; /**< (DUALTIMER Offset: 0xFEC) Peripheral ID Register 3 */
  __I  uint8_t  Reserved20[3];
  RoReg8  TIMERPCELLID0;  /**< (DUALTIMER Offset: 0xFF0) Component ID Register 0 */
  __I  uint8_t  Reserved21[3];
  RoReg8  TIMERPCELLID1;  /**< (DUALTIMER Offset: 0xFF4) Component ID Register 1 */
  __I  uint8_t  Reserved22[3];
  RoReg8  TIMERPCELLID2;  /**< (DUALTIMER Offset: 0xFF8) Component ID Register 2 */
  __I  uint8_t  Reserved23[3];
  RoReg8  TIMERPCELLID3;  /**< (DUALTIMER Offset: 0xFFC) Component ID Register 3 */
} Dualtimer;

