remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/dualtimer.h
#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief DUALTIMER hardware registers */
typedef struct {  /* ARM General Purpose Dual Timer */
  __IO DUALTIMER_TIMER1LOAD_Type      TIMER1LOAD;     /**< Offset: 0x00 (R/W  32) Timer 1 Load Register */
  __I  DUALTIMER_TIMER1VALUE_Type     TIMER1VALUE;    /**< Offset: 0x04 (R/   32) Timer 1 Current Value Register */
  __IO DUALTIMER_TIMER1CONTROL_Type   TIMER1CONTROL;  /**< Offset: 0x08 (R/W   8) Timer 1 Control Register */
       RoReg8                         Reserved1[0x3];
  __O  DUALTIMER_TIMER1INTCLR_Type    TIMER1INTCLR;   /**< Offset: 0x0C ( /W   8) Timer 1 Interrupt Clear Register */
       RoReg8                         Reserved2[0x3];
  __I  DUALTIMER_TIMER1RIS_Type       TIMER1RIS;      /**< Offset: 0x10 (R/    8) Timer 1 Raw Interrupt Status Register */
       RoReg8                         Reserved3[0x3];
  __I  DUALTIMER_TIMER1MIS_Type       TIMER1MIS;      /**< Offset: 0x14 (R/    8) Timer 1 Masked Interrupt Status Register */
       RoReg8                         Reserved4[0x3];
  __IO DUALTIMER_TIMER1BGLOAD_Type    TIMER1BGLOAD;   /**< Offset: 0x18 (R/W  32) Timer 1 Background Load Register (Reload Value for Period Mode) */
       RoReg8                         Reserved5[0x4];
  __IO DUALTIMER_TIMER2LOAD_Type      TIMER2LOAD;     /**< Offset: 0x20 (R/W  32) Timer 2 Load Register */
  __I  DUALTIMER_TIMER2VALUE_Type     TIMER2VALUE;    /**< Offset: 0x24 (R/   32) Timer 2 Current Value Register */
  __IO DUALTIMER_TIMER2CONTROL_Type   TIMER2CONTROL;  /**< Offset: 0x28 (R/W   8) Timer 2 Control Register */
       RoReg8                         Reserved6[0x3];
  __O  DUALTIMER_TIMER2INTCLR_Type    TIMER2INTCLR;   /**< Offset: 0x2C ( /W   8) Timer 2 Interrupt Clear Register */
       RoReg8                         Reserved7[0x3];
  __I  DUALTIMER_TIMER2RIS_Type       TIMER2RIS;      /**< Offset: 0x30 (R/    8) Timer 2 Raw Interrupt Status Register */
       RoReg8                         Reserved8[0x3];
  __I  DUALTIMER_TIMER2MIS_Type       TIMER2MIS;      /**< Offset: 0x34 (R/    8) Timer 2 Masked Interrupt Status Register */
       RoReg8                         Reserved9[0x3];
  __IO DUALTIMER_TIMER2BGLOAD_Type    TIMER2BGLOAD;   /**< Offset: 0x38 (R/W  32) Timer 2 Background Load Register (Reload Value for Period Mode) */
       RoReg8                         Reserved10[0xEC4];
  __IO DUALTIMER_TIMERITCR_Type       TIMERITCR;      /**< Offset: 0xF00 (R/W   8) Integration Test Control Register */
       RoReg8                         Reserved11[0x3];
  __O  DUALTIMER_TIMERITOP_Type       TIMERITOP;      /**< Offset: 0xF04 ( /W   8) Integration Test Output Set Register */
       RoReg8                         Reserved12[0xCB];
  __I  DUALTIMER_TIMERPERIPHID4_Type  TIMERPERIPHID4; /**< Offset: 0xFD0 (R/    8) Peripheral ID Register 4 */
       RoReg8                         Reserved13[0x3];
  __I  DUALTIMER_TIMERPERIPHID5_Type  TIMERPERIPHID5; /**< Offset: 0xFD4 (R/    8) Peripheral ID Register 5 */
       RoReg8                         Reserved14[0x3];
  __I  DUALTIMER_TIMERPERIPHID6_Type  TIMERPERIPHID6; /**< Offset: 0xFD8 (R/    8) Peripheral ID Register 6 */
       RoReg8                         Reserved15[0x3];
  __I  DUALTIMER_TIMERPERIPHID7_Type  TIMERPERIPHID7; /**< Offset: 0xFDC (R/    8) Peripheral ID Register 7 */
       RoReg8                         Reserved16[0x3];
  __I  DUALTIMER_TIMERPERIPHID0_Type  TIMERPERIPHID0; /**< Offset: 0xFE0 (R/    8) Peripheral ID Register 0 */
       RoReg8                         Reserved17[0x3];
  __I  DUALTIMER_TIMERPERIPHID1_Type  TIMERPERIPHID1; /**< Offset: 0xFE4 (R/    8) Peripheral ID Register 1 */
       RoReg8                         Reserved18[0x3];
  __I  DUALTIMER_TIMERPERIPHID2_Type  TIMERPERIPHID2; /**< Offset: 0xFE8 (R/    8) Peripheral ID Register 2 */
       RoReg8                         Reserved19[0x3];
  __I  DUALTIMER_TIMERPERIPHID3_Type  TIMERPERIPHID3; /**< Offset: 0xFEC (R/    8) Peripheral ID Register 3 */
       RoReg8                         Reserved20[0x3];
  __I  DUALTIMER_TIMERPCELLID0_Type   TIMERPCELLID0;  /**< Offset: 0xFF0 (R/    8) Component ID Register 0 */
       RoReg8                         Reserved21[0x3];
  __I  DUALTIMER_TIMERPCELLID1_Type   TIMERPCELLID1;  /**< Offset: 0xFF4 (R/    8) Component ID Register 1 */
       RoReg8                         Reserved22[0x3];
  __I  DUALTIMER_TIMERPCELLID2_Type   TIMERPCELLID2;  /**< Offset: 0xFF8 (R/    8) Component ID Register 2 */
       RoReg8                         Reserved23[0x3];
  __I  DUALTIMER_TIMERPCELLID3_Type   TIMERPCELLID3;  /**< Offset: 0xFFC (R/    8) Component ID Register 3 */
} Dualtimer;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** @}*/


#endif /* _SAMB11_DUALTIMER_COMPONENT_ */
